Revit 2027 API
Document.Equals Method
 Determines whether the specified Object equals to this Object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
public:
virtual bool Equals(
	Object^ obj
) override
abstract Equals :
        obj : Object -> bool
override Equals :
        obj : Object -> bool
Parameters
obj Object
Return Value
Boolean
Remarks
 Two document instances are considered equal if they represent the same document currently opened in the Revit session.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace